{"Compendium-of-Uselessness/Code/ECS":{"slug":"Compendium-of-Uselessness/Code/ECS","filePath":"Compendium of Uselessness/Code/ECS.md","title":"ECS","links":[],"tags":[],"content":"ECS, or Entity Component System (placeholder)"},"Projects/Bloom":{"slug":"Projects/Bloom","filePath":"Projects/Bloom.md","title":"Bloom","links":["Compendium-of-Uselessness/Code/ECS"],"tags":[],"content":"A rudimentary game engine developed in C# utilizing the Raylib framework developed as a training exercise and test of my knowledge and capability as a programmer.\nImplemented features include a user interface developed with ImGui.NET based on Unity, an Entity Component System, and a system to save and load “scene” files, automatically generating objects via JSON files that can be saved and loaded from within the editor as well as modified by hand."},"Projects/Homebrew":{"slug":"Projects/Homebrew","filePath":"Projects/Homebrew.md","title":"Homebrew","links":[],"tags":[],"content":""},"Projects/Mother-3":{"slug":"Projects/Mother-3","filePath":"Projects/Mother 3.md","title":"Mother 3","links":["Compendium-of-Uselessness/Code/ECS","Projects/Bloom"],"tags":[],"content":"The “modern era” of the EarthBound 64 community began in 2019 with a Discord server created by member legogarrettz (now PolyGarrett) to showcase his recreations of models and future game development endeavors. I (Kristen, formerly Zen64) worked on programming and modding games for most projects Garrett was involved with.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTitleDeveloperEngineTimeframeUnnamed(*?)JG ProductionsBlender Game Engine v2.79Apr. 2019 - July 2019OcarinaBoundGarrett &amp; KristenOcarina of TimeNov. 2019 - Aug. 2020Mother 3 SpinGarrett &amp; KristenUnityFeb. 2022EarthBound 64 RecreationTeam PollysoftGodotJuly 2022 - Aug. 2024Project ChiliThe Chili BoisUnityJan. 2023 - Aug. 2024ScovilleKristenGodotOct. 2023 + July 2024libdragoTeam Save HirokiNintendo 64Nov. 2024 - Dec. 2024\n\nJG Productions - Blender Game Engine\nThe first modern attempt at recreating the game began in April of 2019 by community member JG Productions utilizing the Blender Game Engine, a now defunct game engine running in Blender v2.79.\nFuture content note: I remember effectively none of this era, will need help for this.\n\nGarrett &amp; Kristen - Ocarina of Time\nCustom models of Flint and Lucas created by Garrett that were imported into Ocarina of Time, with Lucas replacing young Link and Flint replacing adult Link. Models and textures were created by Garrett, while rigging and mods applied to Ocarina of Time were done by me.\nThe project was covered by Tony from Hard4Games.\n\nMore misc. footage, with custom maps by Garrett and custom music imports by me.\n\n\n\n\nsnowwood would go on to create several animations utilizing the OcarinaBound ROM, which was built off of the Ocarina of Time Debug ROM, allowing for features such as custom cutscene creation.\n\n\nFuture content note: snowwood’s custom animations post-OcarinaBound.\n\nGarrett &amp; Kristen - “Mother 3 Spin”\nThe first Unity build made by Garrett and I, internally dubbed the “spin” build for its unique attack animation which was later found to be a mistranslation. github.com/fulgurbloom/Mother3\nBuild is made within one month as a proof of concept and is quickly dropped due to burnout.\nA rudimentary pork bean controller would later be implemented by Garrett.\nThis was the first private test video recorded of the project, which would then go on to be leaked to the then growing Chili Bois Discord server by a user named Snakeshroom.\n\n\n\n\nTeam Pollysoft - Godot “The EarthBound 64 Experience”\nTeam Pollysoft begins development on their recreation project, initially titled “EarthBound 64 Recreation” and later rebranded to “The EarthBound 64 Experience.”\nvideo-game-beta-remakes.fandom.com/wiki/The_EarthBound_64_Experience\n\n\n\n\nAugust 2024 was the last time an announcement was made regarding development with radio silence following after, although development has supposedly continued internally.\n\nKristen - Godot + Unity “Scoville”\nBeginning in October 2023, I attempted to utilize Earthbound 64 assets and my existing knowledge of C# in attempts to learn the Godot engine under the title Scoville, a reference to the prior team name and a measurement of heat in chili peppers. Short-lived, but relevant.\nIn August 2024, I would go on to quickly recreate a rudimentary form of Project Chili’s foundation in a less bloated and more easily testable format. All development done on this test was recorded… and completely forgotten and unused! Lots of wasted time toying with Unity’s quirks, settings, and packages. Fun nonetheless.\n\n\nThe Chili Bois - Unity “Project Chili”\nThe most mature demo developed by fans to date is Project Chili, with a team consisting of:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKristenProgrammingGarrettArt recreationsSamTheSalmonArt recreationsEchoesWriting, fact-checkingPineappleCarlFact-checkingsnowwoodArt recreations, fact-checking\nThe goal of the project was to recreate the Spaceworld 1997 demo build of the game as accurately as possible.\nThe project ends development in August 2024 as a final rough demo is built and sent off to Kody Nokolo, a controversial community member (vermin) visiting a Q&amp;A session with Shigesato Itoi with intent to showcase the demo and give a copy to him. This did not happen. I left the project immediately after this for personal reasons. Garrett would then take over and invite a new programmer to briefly flesh out the battle system and implement new playable environments.\n\nTeam Save Hiroki - Nintendo 64 “libdrago”\nA brief reach into the Nintendo 64 homebrew development scene. The team for this project consisted of:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeProgrammingZucchinoArt recreationsPictoArt recreationsSamTheSalmonArt recreationsEchoesFact-checkingPineappleCarlFact-checkingUtilizing libdragon and initially with the raylib4Nintendo64 framework, this homebrew project aimed to create a barebones game engine capable of running on real Nintendo 64 hardware with the intention of creating new assets with greater accuracy than before.\nOver time, raylib4Nintendo64 was scrapped due to its instability and lack of usefulness. Only a few screenshots were taken of this version of the project, its main features including a functional ECS implementation, model and texture rendering, and basic debugging tools. Much of the structure of this project was derived from a previous game engine developed by me, Bloom. Plans included utilizing a modified version of Bloom’s ECS scene editor to efficiently create and modify levels usable on the Nintendo 64.\nThe first functional version build of the project, running in ares. At this point, the project was still utilizing raylib4Nintendo64, and in this screenshot you can see Raylib’s DrawGrid() and DrawModelWires() functions in use with a model of Flint created by Picto.\n\nThis video was taken on TheJokerDeluxe’s Nintendo 64 when I was visiting him while he was sleeping on the couch, ignoring his guest.\n"},"index":{"slug":"index","filePath":"index.md","title":"fulgurbloom Index","links":[],"tags":[],"content":"This is a blank Quartz installation.\nRunning on fulgurbloom.me (placeholder index page)"}}